blog/return-to-control-right.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-08 Fri 08:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Return To Control-Right Using XModmap And XCape</title>
<meta name="author" content="T.V Raman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Return To Control-Right Using XModmap And XCape</h1>
<div id="outline-container-org26112df" class="outline-2">
<h2 id="org26112df"><span class="section-number-2">1.</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
See previous article on
<a href="https://emacspeak.blogspot.com/2023/09/emacs-ergonomics-dont-punish-your.html">Dont
Punish Your Finger Tips</a> that described how to minimize chording in
Emacs. That article alluded to possibly using <span class="underline">Return</span> as an
additional <span class="underline">Control<sub>Right</sub></span> key; this article describes   the
implementation and things I discovered in setting it up.
</p>

<p>
The design described here was discovered by <a href="https://www.google.com/search?q=Return+Control%5FR+Xmodmap+Xcape&amp;num=25">this Google search</a>.
</p>
</div>
</div>

<div id="outline-container-org95477e4" class="outline-2">
<h2 id="org95477e4"><span class="section-number-2">2.</span> Overview Of Changes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org48cb184" class="outline-3">
<h3 id="org48cb184"><span class="section-number-3">2.1.</span> XModmap</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Add the following stanza to your XModmap file to set up the needed
  keys:
</p>

<pre class="example">
! RET as Ctrl_R
 remove Control = Control_R
 keycode 0x69 = Return
 keycode 0x24 = Control_R
 add Control = Control_R
</pre>
</div>
</div>

<div id="outline-container-org9508184" class="outline-3">
<h3 id="org9508184"><span class="section-number-3">2.2.</span> XCape</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Next, have XCape emit <span class="underline">Control<sub>R</sub></span> when <span class="underline">Return</span> is held down:
</p>

<pre class="example">
Control_R=Return;\
</pre>

<p>
You can find the complete implementation below:
</p>

<ul class="org-ul">
<li><a href="https://github.com/tvraman/emacspeak/blob/master/stumpwm/xmodmap#L11">XModmap</a> Setup.</li>
<li><a href="https://github.com/tvraman/emacspeak/blob/master/tvr/xcape.sh#L21">XCape Setup</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org79a0a89" class="outline-2">
<h2 id="org79a0a89"><span class="section-number-2">3.</span> Lessons Learn</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>1. The above works &#x2014; I can now hold down <span class="underline">Return</span> with my
right hand when hitting keys like <span class="underline">a</span> with my left; this  makes
my fingers happy.</li>
<li>One  issue that I failed to fix &#x2014; though unimportant except for
my curiosity:</li>
<li>The <span class="underline">Control<sub>R</sub></span> key on my laptop has now turned into a <span class="underline">Return</span>
key, it produces <span class="underline">Return</span> in <b>all cases</b>, i.e., whether tapped or
held-down.</li>

<li>I still continue to find XModmap confusing &#x2014; though that is
likely my fault, and not that of XModmap.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-08 Fri 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2023-09-08 Fri 08:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>